---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsNotCompatibleForTypeChange
source: html/6f0e719f-1e00-aa90-9bc0-969374814561.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsNotCompatibleForTypeChange Property

Some of the selected groups are not compatible with the new group type that was chosen.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupsNotCompatibleForTypeChange { get; }
```